cask_args appdir: "/Applications"
tap "homebrew/cask-fonts"

mas "A Companion for SwiftUI", id: 1485436674
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Deliveries", id: 924726344
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "Pixelmator", id: 407963104
mas "Transporter", id: 1450874784
mas "Magnet", id: 441258766
mas "Paste", id: 967805235
mas "Reeder 5", id: 1529448980
mas "Slack", id: 803453959
mas "Soulver 2", id: 413965349
mas "Spark", id: 1176895641
mas "Tot", id: 1491071483
mas "TweetBot", id: 1384080005
mas "Ulysses", id: 1225570693

brew "apktool"
brew "awscli"
brew "bash"
brew "bat"
brew "bazel"
brew "bzip2" # Needed manually for idb-companion
brew "chisel"
brew "chruby"
brew "cloc"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "diff-so-fancy"
brew "dust" # Better du -sh
brew "exa" # Better ls
brew "fasd" # Fuzzy open for recent files
brew "fd" # Better find
brew "findutils" # Extensions on 'find' such as --type f
brew "fish"
brew "fzf"
brew "gh"
brew "ghi"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gource"
brew "graphviz"
brew "charmbracelet/homebrew-tap/glow"
brew "heroku/brew/heroku"
brew "hexyl" # Pretty hex viewer
brew "hub"
brew "hugo"
brew "hyperfine" # Command line perf
brew "idb-companion" # iOS development bridge (Flipper)
brew "ios-deploy"
brew "isacikgoz/gitin/gitin"
brew "jfrog-cli-go"
brew "keith/formulae/tag" # keith/formula
brew "less" # Keep less up to date
brew "mdcat" # Terminal Markdown rendering
brew "mint"
brew "mitmproxy"
brew "neovim"
brew "node"
brew "python"
brew "radare2"
brew "rbenv"
brew "rustup"
brew "scmpuff"
brew "speedtest"
brew "the_silver_searcher"
brew "swiftdocorg/formulae/swift-doc"
brew "tokei" # Better cloc
brew "tig"
brew "vim"
brew "watchexec" # Watch directory, perform action
brew "wget"
brew "xclip" # Makes copying bat output easier
brew "zsh"
#brew "z" # NOTE: Use fisher-z
brew "zlib" # Needed manually for idb-companion

brew "apktool"
brew "bat"
brew "chisel"
brew "dust"
brew "exa"
brew "fd"
brew "flight-school/formulae/ner"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "go"
brew "graphviz"
brew "hexyl"
brew "hub"
brew "hyperfine"
brew "jfrog-cli-go"
brew "mdcat"
brew "mint"
brew "mitmproxy"
brew "neovim"
brew "scmpuff"
brew "tokei"
brew "watchexec"

cask "1Password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "charles"
cask "cleanshot"
cask "dash"
cask "deckset"
cask "docker"
cask "fork"
cask "iterm2"
cask "kaleidoscope"
cask "lingon-x"
cask "notion"
cask "nova"
cask "obsidian"
cask "omnifocus"
cask "paw"
cask "provisionql"
cask "proxyman"
cask "quitter"
cask "raycast"
cask "rocket" # Slack-esque emoji picker for macOS
cask "reveal"
cask "visual-studio-code"
cask "zoom"

tap "charmbracelet/homebrew-tap"
tap "dduan/homebrew-formulae"
tap "facebook/fb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "isacikgoz/gitin"
tap "keith/formulae"
tap "peripheryapp/periphery"
tap "teamookla/speedtest"
