brew "uptech/oss/alt"
brew "apktool" 
brew "bat"
brew "chisel" 
brew "dust" 
brew "exa" 
brew "fd"
brew "flight-school/formulae/ner"
brew "fzf" 
brew "gh"
brew "git-lfs" 
brew "go"
brew "graphviz" 
brew "hexyl" 
brew "hub" 
brew "hyperfine"
brew "jfrog-cli-go" 
brew "mdcat" 
brew "mint"
brew "mitmproxy" 
brew "neovim"
brew "scmpuff" 
brew "tokei" 
brew "vela" 
brew "watchexec"
