cask_args appdir: "/Applications"
tap "homebrew/cask-fonts"

#mas "A Companion for SwiftUI", id: 1485436674
#mas "DaisyDisk", id: 411643860
#mas "Dato", id: 1470584107
#mas "Deliveries", id: 924726344
#mas "Developer", id: 640199958
#mas "pixelmator", id: 407963104
#mas "Transporter", id: 1450874784
#mas "Magnet", id: 441258766
#mas "Paste", id: 967805235
#mas "Slack", id: 803453959
#mas "Soulver 2", id: 413965349
#mas "Spark", id: 1176895641
#mas "Tot", id: 1491071483
#mas "TweetBot", id: 1384080005
#mas "Ulysses", id: 1225570693

brew "uptech/oss/alt"
brew "apktool"
brew "awscli"
brew "bash"
brew "bat"
#brew "bazelbuild/tap/bazel"
brew "blender/tap/rome"
brew "chisel"
brew "chruby"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "dduan/formulae/drstring"
brew "dduan/homebrew-formulae/tre" #dduan/formulae
brew "diff-so-fancy"
brew "dust" # Better du -sh
brew "exa" # Better ls
brew "fd" # Better find
brew "fish"
brew "flight-school/formulae/ner"
brew "fzf"
brew "gh"
brew "ghi"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "gource"
brew "graphviz"
brew "charmbracelet/homebrew-tap/glow"
brew "heroku/brew/heroku"
brew "hexyl" # Pretty hex viewer
brew "hub"
brew "hugo"
brew "hyperfine" # Command line perf
brew "isacikgoz/gitin/gitin"
brew "jfrog-cli-go"
brew "keith/formulae/tag" # keith/formula
brew "mdcat" # Terminal Markdown rendering
brew "mint"
brew "mitmproxy"
brew "neovim"
brew "node"
brew "python"
brew "rbenv"
brew "scmpuff"
brew "speedtest"
brew "the_silver_searcher"
brew "tokei" # Better cloc
brew "tig"
brew "vela" # Drone for Target
brew "vim"
brew "watchexec" # Watch directory, perform action
brew "wget"
brew "zsh"
#brew "z" # NOTE: Use fisher-z

# cask "FlawlessApp"
cask "1Password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "bettertouchtool"
cask "charles"
cask "cleanshot"
cask "deckset"
cask "docker"
cask "fork"
cask "iterm2"
cask "java"
cask "kaleidoscope"
cask "notion"
cask "nova"
cask "obsidian"
cask "omnifocus"
cask "paw"
cask "provisionql"
cask "quitter"
cask "rocket" # Slack-esque emoji picker for macOS
cask "reveal"
cask "visual-studio-code"
cask "zoom"

#tap "bazelbuild/tap"
tap "blender/tap"
tap "charmbracelet/homebrew-tap"
tap "dduan/homebrew-formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "isacikgoz/gitin"
tap "keith/formulae"
tap "peripheryapp/periphery"
tap "teamookla/speedtest"
tap "uptech/oss/alt"
