# Taps
tap 'atlassian/homebrew-acli'
tap 'ankitpokhrel/jira-cli'
tap 'charmbracelet/homebrew-tap'
tap 'hmarr/tap'
tap 'isacikgoz/gitin'
tap 'JakeWharton/repo'
tap 'keith/formulae'
tap 'majd/repo'
tap 'mdogan/zulu'
tap 'milend/taps'
tap 'oven-sh/bun'
# tap 'robotsandpencils/made'
tap 'teamookla/speedtest'
tap 'wader/tap'
tap 'withered-magic/brew'

# Formulae
brew 'acli'
brew 'aria2' # Used to speed up xcodes
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bazelisk'
brew 'buildifier'
brew 'bun'
brew 'bzip2' # Needed manually for idb-companion
brew 'charmbracelet/homebrew-tap/glow'
brew 'chisel'
brew 'chruby'
brew 'cloc'
brew 'colordiff'
brew 'coreutils'
brew 'ctags'
brew 'diff-so-fancy'
brew 'direnv'
# brew 'dockutil' # Install manually
brew 'duf'
brew 'dust' # Better du -sh
brew 'dylibtree'
brew 'eza' # Better ls
brew 'fd' # Better find
brew 'findutils' # Extensions on 'find' such as --type f
brew 'fish'
brew 'fx'
brew 'fzf'
brew 'gdu'
brew 'gh'
brew 'ghi'
brew 'git'
brew 'git-delta'
brew 'git-extras'
brew 'git-lfs'
brew 'gnu-sed'
brew 'go'
brew 'gource'
brew 'gpg'
brew 'graphviz'
brew 'grpcurl'
brew 'gron'
brew 'hexyl' # Pretty hex viewer
brew 'htop'
brew 'hub'
brew 'hugo'
brew 'hyperfine' # Command line perf
# fixme brew 'ipatool' # tap majd/repo
brew 'ios-deploy'
brew 'isacikgoz/gitin/gitin'
brew 'jfrog-cli'
brew 'jira-cli'
brew 'jless'
brew 'jq'
brew 'keith/formulae/git-pile'
brew 'keith/formulae/reminders-cli' # keith/formula
brew 'keith/formulae/tag' # keith/formula
brew 'less' # Keep less up to date
brew 'mdcat' # Terminal Markdown rendering
brew 'mint'
# fixme brew 'mitmproxy'
brew 'neovim'
brew 'node'
brew 'openjdk'
brew 'pv'
brew 'pyenv'
brew 'python'
brew 'radare2'
brew 'rbenv'
brew 'rg'
brew 'rustup'
brew 'scmpuff'
brew 'shellcheck'
brew 'sourcegraph/src-cli/src-cli'
brew 'speedtest-cli'
brew 'starpls'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tokei' # Better cloc
brew 'tree'
brew 'uv'
# fixme brew 'vitals' # Process monitor
brew 'wader/tap/fq'
brew 'watchexec' # Watch directory, perform action
brew 'wget'
brew 'xclip' # Makes copying bat output easier
brew 'xcodes'
brew 'zoxide'
brew 'zsh'
# brew 'z' # NOTE: Use fisher-z
# brew 'zulu-jdk19'
